JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_lpi2c.c
            if (kStatus_Success == result)
            {
                if ((transfer->flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
                {
                    result = LPI2C_MasterStop(base);
                }
            }
        }
    }

    return result;
}

/*!
 * brief Creates a new handle for the LPI2C master non-blocking APIs.
 *
 * The creation of a handle is for use with the non-blocking APIs. Once a handle
 * is created, there is not a corresponding destroy handle. If the user wants to
 * terminate a transfer, the LPI2C_MasterTransferAbort() API shall be called.
 *
 *
 * note The function also enables the NVIC IRQ for the input LPI2C. Need to notice
 * that on some SoCs the LPI2C IRQ is connected to INTMUX, in this case user needs to
 * enable the associated INTMUX IRQ in application.
 *
 * param base The LPI2C peripheral base address.
 * param[out] handle Pointer to the LPI2C master driver handle.
 * param callback User provided pointer to the asynchronous callback function.
 * param userData User provided pointer to the application callback data.
 */
void LPI2C_MasterTransferCreateHandle(LPI2C_Type *base,
                                      lpi2c_master_handle_t *handle,
                                      lpi2c_master_transfer_callback_t callback,
                                      void *userData)
{
    uint32_t instance;

    assert(NULL != handle);

    /* Clear out the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Look up instance number */
    instance = LPI2C_GetInstance(base);

    /* Save base and instance. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Save this handle for IRQ use. */
    s_lpi2cMasterHandle[instance] = handle;

    /* Set irq handler. */
    s_lpi2cMasterIsr = LPI2C_MasterTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterIrqFlags);

    /* Enable NVIC IRQ, this only enables the IRQ directly connected to the NVIC.
     In some cases the LPI2C IRQ is configured through INTMUX, user needs to enable
     INTMUX IRQ in application code. */
    (void)EnableIRQ(kLpi2cIrqs[instance]);
}

static void LPI2C_TransferStateMachineSendCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);
    uint16_t sendval;

    /* Make sure there is room in the tx fifo for the next command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }

    /* Issue command. buf is a uint8_t* pointing at the uint16 command array. */
    sendval    = ((uint16_t)handle->buf[0]) | (((uint16_t)handle->buf[1]) << 8U);
    base->MTDR = sendval;
    handle->buf++;
    handle->buf++;

    /* Count down until all commands are sent. */
    if (--handle->remainingBytes == 0U)
    {
        /* Choose next state and set up buffer pointer and count. */
        if (0U != handle->transfer.dataSize)
        {
            /* Either a send or receive transfer is next. */
            handle->state          = (uint8_t)kTransferDataState;
            handle->buf            = (uint8_t *)handle->transfer.data;
            handle->remainingBytes = (uint16_t)handle->transfer.dataSize;
            if (handle->transfer.direction == kLPI2C_Read)
            {
                /* Disable TX interrupt */
                LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
                /* Issue command to receive data. A single write to MTDR can issue read operation of
                    0xFFU + 1 byte of data at most, so when the dataSize is larger than 0x100U, push
                    multiple read commands to MTDR until dataSize is reached. */
                size_t tmpRxSize = handle->transfer.dataSize;
                while (tmpRxSize != 0U)
                {
                    LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount);
                    while ((size_t)FSL_FEATURE_LPI2C_FIFO_SIZEn(base) == stateParams->txCount)
                    {
                        LPI2C_MasterGetFifoCounts(base, NULL, &stateParams->txCount);
                    }

                    if (tmpRxSize > 256U)
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(0xFFU);
                        tmpRxSize -= 256U;
                    }
                    else
                    {
                        base->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)LPI2C_MTDR_DATA(tmpRxSize - 1U);
                        tmpRxSize  = 0U;
                    }
                }
            }
        }
        else
        {
            /* No transfer, so move to stop state. */
            handle->state = (uint8_t)kStopState;
        }
    }
}

static void LPI2C_TransferStateMachineReadCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);

    /* Make sure there is room in the tx fifo for the read command. */
    if (0U == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }

    base->MTDR = (uint32_t)kRxDataCmd | LPI2C_MTDR_DATA(handle->transfer.dataSize - 1U);

    /* Move to transfer state. */
    handle->state = (uint8_t)kTransferDataState;
    if (handle->transfer.direction == kLPI2C_Read)
    {
        /* Disable TX interrupt */
        LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterTxReadyFlag);
    }
}

static void LPI2C_TransferStateMachineTransferData(LPI2C_Type *base,
                                                   lpi2c_master_handle_t *handle,
                                                   lpi2c_state_machine_param_t *stateParams)
{
    assert(stateParams != NULL);

    if (handle->transfer.direction == kLPI2C_Write)
    {
        /* Make sure there is room in the tx fifo. */
        if (0U == stateParams->txCount--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Put byte to send in fifo. */
        base->MTDR = *(handle->buf)++;
    }
    else
    {
        /* XXX handle receive sizes > 256, use kIssueReadCommandState */
        /* Make sure there is data in the rx fifo. */
        if (0U == stateParams->rxCount--)
        {
            stateParams->state_complete = true;
            return;
        }

